src/Documents/Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Document>
		<Properties>
			<Name>Заказ</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ДанныеЗаказов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Курьер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Курьеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаказов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Зона</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Зоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительнаяИнформация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПриемаВРаботу</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНазначения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оценка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособОплаты</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Оплачен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресДоставки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/Enums/СтатусыЗаказов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<Enum>
		<Properties>
			<Name>СтатусыЗаказов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Принят</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВРаботе</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Завершен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Назначен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Формируется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Documents/Заказ/Ext/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	// регистр ДанныеЗаказов
	//Движения.ДанныеЗаказов.Записывать = Истина;
	//Движение = Движения.ДанныеЗаказов.Добавить();
	//Движение.Клиент = Клиент;
	//Движение.Курьер = Курьер;
	//Движение.Зона = Зона;
	//Движение.Статус = Статус;
	//Движение.ДатаНазначения = ДатаНазначения;
	//Движение.ДатаПриемаВРаботу = ДатаПриемаВРаботу;
	//Движение.ДатаЗавершения = ДатаЗавершения;

	Если Статус = Перечисления.СтатусыЗаказов.Принят Тогда
		
		Если Тележка.ПолучитьЯзык(Клиент.client_id) = "EN" тогда
			ТекстСообщения = "Order accepted, assigned number:" + Номер + "
			|Order price " + Сумма + "$";			
		иначе
			ТекстСообщения = "Заказ принят, присвоен номер:" + Номер + "
			|Сумма заказа " + Сумма;
		конецесли;
		
		Обработки.Telegram.ОтправитьСообщение(Клиент.client_id, ТекстСообщения);
		
	ИначеЕсли Статус = Перечисления.СтатусыЗаказов.ВРаботе Тогда
		
		// Уведомляем клиента
		Если Тележка.ПолучитьЯзык(Клиент.client_id) = "EN" тогда
			ТекстСообщения = "Your order №" + Номер + " taken to work, courier " + Курьер;
		иначе
			ТекстСообщения = "Ваш заказ номер " + Номер + " взят в работу, курьер " + Курьер;
		конецесли;
		
		Обработки.Telegram.ОтправитьСообщение(Клиент.client_id, ТекстСообщения);
		
		// Уведомляем курьера
		Если Тележка.ПолучитьЯзык(Курьер.client_id) = "EN" тогда
			ТекстСообщения = "Order №" + Номер + " taken to work" ;
		иначе
			ТекстСообщения = "Заказ номер " + Номер + " взят в работу" ;
		конецесли;
		
		Обработки.Telegram.ОтправитьСообщение(Курьер.client_id, ТекстСообщения);
		
	ИначеЕсли Статус = Перечисления.СтатусыЗаказов.Завершен Тогда
		
		Если Тележка.ПолучитьЯзык(Клиент.client_id) = "EN" тогда
			ТекстСообщения = "Your order №" + Номер + " delivered";
			
			КлавиатураВСообщении = "{""inline_keyboard"":[[{""text"": ""Order is not delivered"",""callback_data"": ""\/report" + Номер + """}]]}";
			ТекстСообщения = ТекстСообщения + "&reply_markup=" + КлавиатураВСообщении;
		иначе
			ТекстСообщения = "Ваш заказ номер " + Номер + " доставлен";
			
			КлавиатураВСообщении = "{""inline_keyboard"":[[{""text"": ""Заказ не доставлен"",""callback_data"": ""\/report" + Номер + """}]]}";
			ТекстСообщения = ТекстСообщения + "&reply_markup=" + КлавиатураВСообщении;
		конецесли;
		
		Обработки.Telegram.ОтправитьСообщение(Клиент.client_id, ТекстСообщения);
		
		
		
	ИначеЕсли Статус = Перечисления.СтатусыЗаказов.Отменен Тогда
		
		Если Тележка.ПолучитьЯзык(Клиент.client_id) = "EN" тогда
			// Уведомляем клиента
			ТекстСообщения = "Your order №" + Номер + " canceled";
		иначе
			// Уведомляем клиента
			ТекстСообщения = "Ваш заказ номер " + Номер + " отменен";
		конецесли;	
		
		Обработки.Telegram.ОтправитьСообщение(Клиент.client_id, ТекстСообщения);
		
		Если Тележка.ПолучитьЯзык(Курьер.client_id) = "EN" тогда
			// Уведомляем курьера
			ТекстСообщения = "Order №" + Номер + " canceled";
		иначе
			// Уведомляем курьера
			ТекстСообщения = "Заказ номер " + Номер + " отменен";
		конецесли;
		
		
		Обработки.Telegram.ОтправитьСообщение(Курьер.client_id, ТекстСообщения);
		
		
	конецесли;
	
	//Обработки.Telegram.ОтправитьСообщение(Курьер.client_id, ТекстСообщения);
	
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если Статус = Перечисления.СтатусыЗаказов.ВРаботе Тогда
		// Записываем дату приема в работу
		Если Не ЗначениеЗаполнено(ДатаПриемаВРаботу) Тогда
			ДатаПриемаВРаботу = ТекущаяДата();	
		КонецЕсли;
	ИначеЕсли Статус = Перечисления.СтатусыЗаказов.Отменен ИЛИ 
		Статус = Перечисления.СтатусыЗаказов.Завершен Тогда
		Если Не ЗначениеЗаполнено(ДатаЗавершения) Тогда
			ДатаЗавершения = ТекущаяДата();	
		КонецЕсли;
	КонецЕсли;
	
	// Расчет стоимости
	Если НЕ ЗначениеЗаполнено(Сумма) Тогда
		
		Сумма = Обработки.РасчетСтоимсотиЗаказа.Рассчитать(АдресОтправки, АдресДоставки);	
		
	КонецЕсли;

КонецПроцедуры
